artillery/load_test.yml
config:
  target: 'https://demo-preprod-dot-gleaming-tube-275212.ew.r.appspot.com'
  phases:
    - duration: 600 # 3600
      arrivalRate: 2 #2
      rampTo: 50
  statsInterval: 1
scenarios:
  - name : 'base_url'
    flow:  
    - get:
        url: "/preprod/gae/info"
#  - name : 'preprod-docker-8'
#    flow:  
#    - get:
#        url: "https://preprod-docker-1-dot-demo-preprod-dot-gleaming-tube-275212.appspot.com/preprod/gae/info"
#  - name : 'preprod-docker-8'
#    flow:  
#    - get:
#        url: "/preprod/wait/gae/info"